app/views/courses/show.html.erb

                    <th rowspan="2" style="vertical-align: middle;">Alumnos</th>
                    <th colspan="<%= @course.exams.size %>">Examenes</th>
---
SELECT "exams".* FROM "exams" WHERE "exams"."course_id" = ?  [["course_id", 1]]
SELECT COUNT(*) FROM "exams" WHERE "exams"."course_id" = ?  [["course_id", 1]]

                <tr>
                    <% if @course.exams.empty? %>
---
SELECT  1 AS one FROM "exams" WHERE "exams"."course_id" = ? LIMIT ?  [["course_id", 1], ["LIMIT", 1]]

            <tbody>
                <% @course.students.each do |s| %>
---
SELECT "students".* FROM "students" WHERE "students"."course_id" = ?  [["course_id", 1]]

                            <% @course.exams.each do |e|
                                @mark = e.students.include?(s) ? s.mark_for(e) : "Ausente"
---
SELECT  1 AS one FROM "students" WHERE "students"."course_id" = ? LIMIT ?  [["course_id", 3], ["LIMIT", 1]]

                        <% @course.exams.each do |e| %>
                            <td><%= Result.passed(e.id, e.min).count %></td>
---
SELECT "results".* FROM "results" WHERE (exam_id = ?) AND (mark >= ?)
SELECT COUNT(*) FROM "results" WHERE (exam_id = ?) AND (mark >= ?)

                        <% @course.exams.each do |e| %>
                            <td><%= @course.students.count - (Result.passed(e.id, e.min).count + Result.failed(e.id, e.min).count) %></td>
---
SELECT COUNT(*) FROM "students" WHERE "students"."course_id" = ?  [["course_id", 1]]