app/controllers/courses_controller.rb

  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("year", "created_at", "updated_at", "title") VALUES (?, ?, ?, ?)  [["year", 2018], ["created_at", "2017-12-18 19:18:48.971745"], ["updated_at", "2017-12-18 19:18:48.971745"], ["title", "Curso 2"]]

  def update
    if @course.exams.empty?
      respond_to do |format|
        if @course.update(course_params)
---
UPDATE "courses" SET "title" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["title", "Curso 2"], ["updated_at", "2017-12-18 19:16:30.004737"], ["id", 3]]

  def destroy
    if @course.exams.empty? && @course.students.empty?
      @course.destroy
---
SELECT  1 AS one FROM "exams" WHERE "exams"."course_id" = ? LIMIT ?  [["course_id", 6], ["LIMIT", 1]]
SELECT  1 AS one FROM "students" WHERE "students"."course_id" = ? LIMIT ?  [["course_id", 6], ["LIMIT", 1]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 2]]

  def results
    @course = set_course
    if @course.update_results(result_params)
---
UPDATE "results" SET "mark" = ?, "updated_at" = ? WHERE "results"."id" = ?  [["mark", 8], ["updated_at", "2017-12-17 01:19:44.436944"], ["id", 1]]

  def set_course
    id = params[:id].blank? ? params[:course_id] : params[:id]
    @course = Course.find(id)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]