app/controllers/exams_controller.rb

INSERT INTO "exams" ("course_id", "title", "date", "min", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["course_id", 1], ["title", "Examen 1"], ["date", "2017-01-05"], ["min", 9], ["created_at", "2017-12-13 02:38:50.205175"], ["updated_at", "2017-12-13 02:38:50.205175"]]
---
  def create
    @exam = @course.exams.build(exam_params)

    if @exam.save

UPDATE "exams" SET "min" = ?, "updated_at" = ? WHERE "exams"."id" = ?  [["min", 10], ["updated_at", "2017-12-18 20:28:50.949883"], ["id", 9]]
---
  def update
    if @exam.update_attributes(exam_params)

DELETE FROM "exams" WHERE "exams"."id" = ?  [["id", 2]]
---
  def destroy
    @exam.destroy

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_exams
    @course = Course.find(params[:course_id])

SELECT  "exams".* FROM "exams" WHERE "exams"."course_id" = ? AND "exams"."id" = ? LIMIT ?  [["course_id", 6], ["id", 9], ["LIMIT", 1]]
---
  def set_exam
    @exam = @course.exams.find(params[:id])