app/controllers/students_controller.rb

INSERT INTO "students" ("course_id", "surname", "name", "dni", "number", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @student = @course.students.build(student_params)

    if @student.save

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
  def set_students
    @course = Course.find(params[:course_id])

SELECT  "students".* FROM "students" WHERE "students"."course_id" = ? AND "students"."id" = ? LIMIT ?  [["course_id", 6], ["id", 4], ["LIMIT", 1]]
---
  def set_student
    @student = @course.students.find(params[:id])